#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/terraform relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cloudops-practice/cloudops-practice/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cloudops-practice/cloudops-practice

To view this run in a browser, visit:
https://app.terraform.io/app/andrewdq/cloudops-practice/runs/run-BXWrUAt8eU8UYWwF

Waiting for the plan to start...

Terraform v1.12.2
on linux_amd64
Initializing plugins and modules...
module.alerts.data.azurerm_subscription.current: Reading...
module.resource_groups["southeastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg]
module.resource_groups["eastasia"].azurerm_resource_group.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0xMjIwMzZjMi02YTQ4LTQxODAtYWUyZC1jZmEwZjIzZTBkZjA7b2JqZWN0SWQ9MWRlYmU3NTItZDJhZS00ZTI1LTljMjUtNzc4ZTkzM2U1ZmMwO3N1YnNjcmlwdGlvbklkPTY5NDIxYTAzLWY4ZTYtNGExZS04MWIzLTA3N2FhZWVhNWNlNzt0ZW5hbnRJZD0xNGJhMzgwYi1iOTNhLTRmYzEtYjRlZi04MDM5Y2NhNjFkNzU=]
data.azuread_service_principal.current: Reading...
module.alerts.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7]
data.azuread_service_principal.current: Read complete after 1s [id=1debe752-d2ae-4e25-9c25-778e933e5fc0]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.OperationalInsights/workspaces/shared-laworkspace]
azurerm_postgresql_flexible_server.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql]
module.alerts.azurerm_monitor_action_group.alerts: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/actionGroups/ag-roadmap-maker]
module.secondary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet]
module.primary_network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet]
module.primary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg]
module.secondary_network.azurerm_network_security_group.aks_nsg[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg]
module.secondary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/app]
module.secondary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.primary_network.azurerm_subnet.subnets["aks"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.primary_network.azurerm_subnet.subnets["app"]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/app]
azurerm_postgresql_flexible_server_database.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/databases/roadmap_maker]
azurerm_postgresql_flexible_server_active_directory_administrator.primary: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/administrators/1debe752-d2ae-4e25-9c25-778e933e5fc0]
azurerm_postgresql_flexible_server_firewall_rule.azure_services: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAzureServices]
azurerm_postgresql_flexible_server_firewall_rule.aks_subnet: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/roadmap-maker-southeastasia-psql/firewallRules/AllowAKSSubnet]
module.alerts.azurerm_consumption_budget_subscription.budget: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/providers/Microsoft.Consumption/budgets/roadmap-maker-annual-budget]
module.secondary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-secondary-vnet/subnets/aks]
module.primary_network.azurerm_subnet_network_security_group_association.aks_nsg_association[0]: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/virtualNetworks/roadmap-maker-primary-vnet/subnets/aks]
module.secondary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks]
module.primary_aks.azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks]
module.primary_monitoring.azurerm_monitor_metric_alert.node_not_ready: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/metricAlerts/roadmap-maker-primary-aks-node-not-ready]
module.primary_monitoring.azurerm_monitor_diagnostic_setting.aks_diagnostics: Refreshing state... [id=/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks|roadmap-maker-primary-aks-diagnostics]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.function.azurerm_app_service_plan.function_app_plan will be created
  + resource "azurerm_app_service_plan" "function_app_plan" {
      + id                           = (known after apply)
      + kind                         = "Linux"
      + location                     = "southeastasia"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "traffic-switch-func-plan"
      + reserved                     = true
      + resource_group_name          = "roadmap-maker-southeastasia-rg"

      + sku {
          + capacity = (known after apply)
          + size     = "Y1"
          + tier     = "Dynamic"
        }
    }

  # module.function.azurerm_function_app.function_app_python will be created
  + resource "azurerm_function_app" "function_app_python" {
      + app_service_plan_id             = (known after apply)
      + app_settings                    = {
          + "FUNCTIONS_WORKER_RUNTIME" = "python"
        }
      + custom_domain_verification_id   = (known after apply)
      + default_hostname                = (known after apply)
      + enable_builtin_logging          = true
      + enabled                         = true
      + https_only                      = false
      + id                              = (known after apply)
      + key_vault_reference_identity_id = (known after apply)
      + kind                            = (known after apply)
      + location                        = "southeastasia"
      + name                            = "traffic-switch-func"
      + os_type                         = "linux"
      + outbound_ip_addresses           = (known after apply)
      + possible_outbound_ip_addresses  = (known after apply)
      + resource_group_name             = "roadmap-maker-southeastasia-rg"
      + site_credential                 = (known after apply)
      + storage_account_access_key      = (sensitive value)
      + storage_account_name            = "trafficswitchfuncsa"
      + version                         = "~4"

      + auth_settings (known after apply)

      + connection_string (known after apply)

      + site_config {
          + always_on                        = false
          + app_scale_limit                  = (known after apply)
          + dotnet_framework_version         = "v4.0"
          + elastic_instance_minimum         = (known after apply)
          + ftps_state                       = (known after apply)
          + http2_enabled                    = false
          + ip_restriction                   = (known after apply)
          + linux_fx_version                 = "python|3.9"
          + min_tls_version                  = (known after apply)
          + pre_warmed_instance_count        = (known after apply)
          + runtime_scale_monitoring_enabled = false
          + scm_ip_restriction               = (known after apply)
          + scm_type                         = (known after apply)
          + scm_use_main_ip_restriction      = false
          + use_32_bit_worker_process        = true
          + vnet_route_all_enabled           = (known after apply)
          + websockets_enabled               = false

          + cors (known after apply)
        }

      + source_control (known after apply)
    }

  # module.function.azurerm_storage_account.function_app_storage will be created
  + resource "azurerm_storage_account" "function_app_storage" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "southeastasia"
      + min_tls_version                    = "TLS1_2"
      + name                               = "trafficswitchfuncsa"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "roadmap-maker-southeastasia-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.primary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-primary-aks"
        name                                = "roadmap-maker-primary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "primary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "primary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "primary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "primary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.primary_monitoring.azurerm_monitor_action_group.failover will be created
  + resource "azurerm_monitor_action_group" "failover" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "ag-failover-func"
      + resource_group_name = "roadmap-maker-southeastasia-rg"
      + short_name          = "failover"

      + webhook_receiver {
          + name        = "failover-func"
          + service_uri = (known after apply)
        }
    }

  # module.primary_monitoring.azurerm_monitor_metric_alert.node_not_ready will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "node_not_ready" {
        id                       = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Insights/metricAlerts/roadmap-maker-primary-aks-node-not-ready"
        name                     = "roadmap-maker-primary-aks-node-not-ready"
        tags                     = {}
        # (10 unchanged attributes hidden)

      + action {
          + action_group_id = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.primary_network.azurerm_network_security_group.aks_nsg[0] will be updated in-place
  ~ resource "azurerm_network_security_group" "aks_nsg" {
        id                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-southeastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-primary-vnet-aks-nsg"
        name                = "roadmap-maker-primary-vnet-aks-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAKSInbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "AllowAKSOutbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "3000"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom3000Inbound"
              - priority                                   = 1030
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "5173"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom5173Inbound"
              - priority                                   = 1020
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom80Inbound"
              - priority                                   = 1010
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAKSInbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowAKSOutbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "application" = "roadmap-maker"
            "environment" = "prod"
            "managed-by"  = "terraform"
            "project"     = "cloudops-practice"
        }
        # (2 unchanged attributes hidden)
    }

  # module.secondary_aks.azurerm_kubernetes_cluster.default will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "default" {
        id                                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.ContainerService/managedClusters/roadmap-maker-secondary-aks"
        name                                = "roadmap-maker-secondary-aks"
        tags                                = {
            "application"  = "roadmap-maker"
            "cluster-type" = "secondary"
            "environment"  = "prod"
            "managed-by"   = "terraform"
            "project"      = "cloudops-practice"
            "region"       = "secondary"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {
                "application"  = "roadmap-maker"
                "cluster-type" = "secondary"
                "environment"  = "prod"
                "managed-by"   = "terraform"
                "project"      = "cloudops-practice"
                "region"       = "secondary"
            }
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.secondary_network.azurerm_network_security_group.aks_nsg[0] will be updated in-place
  ~ resource "azurerm_network_security_group" "aks_nsg" {
        id                  = "/subscriptions/69421a03-f8e6-4a1e-81b3-077aaeea5ce7/resourceGroups/roadmap-maker-eastasia-rg/providers/Microsoft.Network/networkSecurityGroups/roadmap-maker-secondary-vnet-aks-nsg"
        name                = "roadmap-maker-secondary-vnet-aks-nsg"
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAKSInbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "VirtualNetwork"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "AllowAKSOutbound"
              - priority                                   = 1000
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "3000"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom3000Inbound"
              - priority                                   = 1020
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "5173"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom5173Inbound"
              - priority                                   = 1010
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          - {
              - access                                     = "Allow"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "80"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyCustom80Inbound"
              - priority                                   = 1040
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowAKSInbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "AllowAKSOutbound"
              + priority                                   = 1000
              + protocol                                   = "*"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
        tags                = {
            "application" = "roadmap-maker"
            "environment" = "prod"
            "managed-by"  = "terraform"
            "project"     = "cloudops-practice"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 0 to destroy.
╷
│ Warning: Deprecated Resource
│ 
│   with module.function.azurerm_app_service_plan.function_app_plan,
│   on modules/function/main.tf line 10, in resource "azurerm_app_service_plan" "function_app_plan":
│   10: resource "azurerm_app_service_plan" "function_app_plan" {
│ 
│ The `azurerm_app_service_plan` resource has been superseded by the
│ `azurerm_service_plan` resource. Whilst this resource will continue to be
│ available in the 2.x and 3.x releases it is feature-frozen for
│ compatibility purposes, will no longer receive any updates and will be
│ removed in a future major release of the Azure Provider.
│ 
│ (and one more similar warning elsewhere)
╵

```

</details>

*Pushed by: @Thanh8804, Action: `pull_request`*